// Setup
const myArray = [];

for(let i = 1; i<6; i++){
  myArray.push(i);
}

// Only change code below this line


/*
Циклы for объявляются с тремя необязательными выражениями, разделенными точкой с запятой:

for (a; b; c), где a оператор инициализации (начало), b - оператор условия (условие), c - конечное выражение (телоцикла).

- Оператор инициализации выполняется только один раз перед запуском цикла. Обычно он используется для определения и настройки вашей переменной цикла.
- Оператор условия оценивается в начале каждой итерации цикла и будет продолжаться до тех пор, пока он оценивается как true. Когда условие находится false в начале итерации, выполнение цикла прекращается. Это означает, что если условие начинается как ложное, ваш цикл никогда не будет выполняться.
- Окончательное выражение выполняется в конце каждой итерации цикла перед следующей проверкой условия и обычно используется для увеличения или уменьшения счетчика цикла.
*/